Revit 2026 API

# FabricationConfigurationGetDamperName Method

---

Gets the damper name from its identifier.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string GetDamperName(
	int damperId
)
```
```vb
Public Function GetDamperName (
	damperId As Integer
) As String
```
```cpp
public:
String^ GetDamperName(
	int damperId
)
```
```fsharp
member GetDamperName :
        damperId : int -> string
```

#### Parameters

damperId Int32
     The damper identifier.

#### Return Value

String The damper name.

| Exception | Condition |
| --- | --- |
| ArgumentException | The damper does not exist. |

#### Reference

FabricationConfiguration Class

Autodesk.Revit.DB Namespace